XML copy.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ws="http://ws.ce.ebiz.com/">
    <soapenv:Header />
    <soapenv:Body>
        <ws:invoke> <!--Optional:-->
            <command><![CDATA[
    
    ]]> </command>
        </ws:invoke>
    </soapenv:Body>
</soapenv:Envelope>


<SignOnLineCmd declare-sunat="1" declare-direct-sunat="1" publish="1" output="PDF">
    <parameter value="20612044733" name="idEmisor" />
    <parameter value="03" name="tipoDocumento" />
    <documento>
        <serieNumero>B001-00000007</serieNumero>
        <correoEmisor>-</correoEmisor>
        <correoAdquiriente>-</correoAdquiriente>
        <tipoDocumentoEmisor>6</tipoDocumentoEmisor>
        <numeroDocumentoEmisor>20612044733</numeroDocumentoEmisor>
        <razonSocialEmisor>ALIMENTOS Y LOGISTICA SIERRA PERU E.I.R.L</razonSocialEmisor>
        <tipoDocumento>03</tipoDocumento>
        <fechaEmision>2025-08-21</fechaEmision>
        <paisPrestacionServicio>PE</paisPrestacionServicio>
        <tipoOperacion>0101</tipoOperacion>
        <ubigeoEmisor>120100</ubigeoEmisor>
        <direccionEmisor>JR. PUNO N° 250 - HUANCAYO - HUANCAYO - JUNÍN</direccionEmisor>
        <urbanizacion>-</urbanizacion>
        <provinciaEmisor>HUANCAYO </provinciaEmisor>
        <departamentoEmisor>JUNÍN</departamentoEmisor>
        <distritoEmisor>HUANCAYO </distritoEmisor>
        <paisEmisor>PE</paisEmisor>
        <tipoDocumentoAdquiriente>1</tipoDocumentoAdquiriente>
        <numeroDocumentoAdquiriente>00000000</numeroDocumentoAdquiriente>
        <razonSocialAdquiriente>CLIENTE EVENTUAL</razonSocialAdquiriente>
        <codigoLocalAnexoEmisor>0000</codigoLocalAnexoEmisor>
        <horaEmision>20:40:58</horaEmision>
        <totalVenta>2.00</totalVenta>
        <textoLeyenda_1>DOS CON 00/100 SOLES</textoLeyenda_1>
        <codigoLeyenda_1>1000</codigoLeyenda_1>
        <inHabilitado>1</inHabilitado>
        <totalImpuestos>0.31</totalImpuestos>
        <totalIgv>0.31</totalIgv>
        <totalValorVentaNetoOpGravadas>1.69</totalValorVentaNetoOpGravadas>
        <ubigeoAdquiriente>120100</ubigeoAdquiriente>
        <tipoMoneda>PEN</tipoMoneda>
        <paisAdquiriente>PE</paisAdquiriente>
        <distritoAdquiriente>HUANCAYO </distritoAdquiriente>
        <departamentoAdquiriente>JUNÍN</departamentoAdquiriente>
        <provinciaAdquiriente>HUANCAYO </provinciaAdquiriente>
        <urbanizacionAdquiriente>-</urbanizacionAdquiriente>
        <totalValorVenta>1.69</totalValorVenta>
        <totalPrecioVenta>2.00</totalPrecioVenta>
        <totalValorVentaNetoOpGratuitas>0.00</totalValorVentaNetoOpGratuitas>
        <totalTributosOpeGratuitas>0.00</totalTributosOpeGratuitas>
        <direccionAdquiriente>-</direccionAdquiriente>
        <item>
            <indicador>D</indicador>
            <numeroOrdenItem>1</numeroOrdenItem>
            <codigoProducto>0</codigoProducto>
            <codigoProductoSUNAT>84000000</codigoProductoSUNAT>
            <descripcion>AZUCAR SPLENDA UNI SOBRE DE STEVIA X 1 GR</descripcion>
            <cantidad>1.00</cantidad>
            <unidadMedida>NIU</unidadMedida>
            <importeUnitarioSinImpuesto>1.694915</importeUnitarioSinImpuesto>
            <importeUnitarioConImpuesto>2.00</importeUnitarioConImpuesto>
            <codigoImporteUnitarioConImpuesto>01</codigoImporteUnitarioConImpuesto>
            <importeTotalSinImpuesto>1.69</importeTotalSinImpuesto>
            <codigoRazonExoneracion>10</codigoRazonExoneracion>
            <importeIgv>0.31</importeIgv>
            <montoBaseIgv>1.69</montoBaseIgv>
            <tasaIgv>18.00</tasaIgv>
            <importeTotalImpuestos>0.31</importeTotalImpuestos>
            <codigoImporteReferencial></codigoImporteReferencial>
            <importeReferencial></importeReferencial>
            <importeDescuento></importeDescuento>
            <importeBaseDescuento></importeBaseDescuento>
            <factorDescuento></factorDescuento>
            <codigoSerieNumeroAfectado></codigoSerieNumeroAfectado>
            <motivoDocumento></motivoDocumento>
            <tipoDocumentoReferenciaPrincip></tipoDocumentoReferenciaPrincip>
            <numeroDocumentoReferenciaPrinc></numeroDocumentoReferenciaPrinc>
            <codigoAuxiliar40_1></codigoAuxiliar40_1>
            <textoAuxiliar40_1></textoAuxiliar40_1>
        </item>
    </documento>
</SignOnLineCmd>